package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class CareParrot extends AppCompatActivity {
    private String[] arrayList = {" Выбор и обустройство клетки \n" +
            " Разбираясь в вопросе как ухаживать за попугаем правильно, вы поймете, что на пернатом питомце нельзя экономить. Выбирайте для него будущий домик, изготовленный из качественных материалов. Не стоит покупать клетку с покрашенными краской прутьями: пернатые любят ее сгрызать и проглатывать, из-за чего часто случаются отравления.\n" +
            " Клетка не должна быть тесной, ее размеры должны давать возможность питомцу свободно расправлять крылья и перепархивать с места на место, не задевая крышу и стенки.\n" +
            " Лучшей формой для апартаментов является прямоугольная, так как в круглой клетке птицы часто теряют ориентацию в пространстве.\n" +
            " Если вы найдете клетку с выдвижным поддоном — это будет лучший вариант жилья для попугая. Пернатые считают клетку своей территорией, они не любят, когда внутрь постоянно просовывают руки. Благодаря выдвижному поддону вы с легкостью сможете ухаживать за клеткой, очищать ее дно, не тревожа лишний раз питомца.\n" +
            " В клетке необходимо установить:\n" +
            " 2-3 кормушки для различных видов корма;\n" +
            " поилку (желательно закрытого типа);\n" +
            " жердочки (если клетка продавалась с пластиковыми жердочками, их лучше заменить на необработанные от коры ветки, которые обязательно перед размещением их в клетке хорошо обработайте от возможных паразитов, обдайте кипятком);\n" +
            " лесенки, качели, зеркальце, канатики и другие игрушки для развлечения любимца;\n" +
            " минеральные подкормки в виде мела, сепии, минерального камня — они не только будут давать необходимые минералы, но и их обгрызание попугаем будет естественным образом стачивать ему клюв. \n" +
            " Клетку нужно устанавливать одной или двумя сторонами возле стены — это будет создавать ощущение безопасности у питомца.\n" +
            " Лучше всего располагать ее на такой высоте, чтобы сидящий на жердочке попугай находился на уровне ваших глаз. Если он будет сидеть слишком высоко, это создаст у него ощущение доминирования и превосходства, если же будет сидеть слишком низко — у него возникнет чувство подавленности. \n" +
            " Правильный уход за попугаем в домашних условиях предполагает регулярные полеты. Не стоит все время держать его взаперти, выпускайте птицу время от времени полетать по комнате, размять крылышки. Это будет поднимать ей настроение и убережет от лишнего веса.\n" +
            " Если же у вас нет возможности давать пернатому свободно перемещаться по помещению, организуйте ему вольер.\n" +
            " Если вы будете содержать парочку, размеры их апартаментов должны быть как минимум в полтора раза больше. Для содержания целой стайки попугайчиков лучше всего подходит вольер.\n" +
            " Температуру в помещении нужно поддерживать на уровне +20-25°С, влажность воздуха не ниже 60-70%. При необходимости увлажняйте воздух специальными приборами-увлажнителями либо просто развешивайте мокрые полотенца возле клетки с питомцем. Слишком сухой воздух иссушивает его слизистые, ухудшает состояние оперения."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_care_parrot);
        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);
        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), ParrotActivity.class);
                startActivity(intent);
            }
        });
    }
}