package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class CareSnake extends AppCompatActivity {
    private String[] arrayList = {"Обустройте террариум\n" +
            "1\n" +
            "Приобретите подходящий по размерам террариум. Террариум представляет собой стеклянную емкость, предназначенную для содержания змей и других рептилий. Он похож на аквариум, но его не нужно заполнять водой. Проследите, чтобы террариум был специально предназначен для змей, так как они очень искусные беглецы и наверняка ускользнут, если террариум не будет иметь надежной крышки. В зависимости от вида змеи вам может понадобиться длинный или высокий террариум. Если вы собираетесь завести крупную змею, вам потребуется более просторный террариум.[1]\n" +
            "Например, если у вас крупный удав, потребуется широкий террариум объемом 150 литров. Если же вы собираетесь завести мелкую древесную змею, достаточно будет 80-литрового террариума. Проследите, чтобы высота террариума превышала его ширину — в этом случае у змеи будет достаточно места, чтобы взбираться вверх по веткам.\n" +
            "Держите в каждом террариуме лишь одну змею. Змеи не являются социальными животными, поэтому каждой змее необходимо отдельное жилище.[2]\n" +
            "\n" +
            "2\n" +
            "Приобретите укрытие, чтобы разместить его в террариуме. Змеи любят заползать в темные закрытые места, где они чувствуют себя в безопасности, и не исключено, что подходящее укрытие даже поможет сохранить здоровье вашего питомца.[3] Приобретите в зоомагазине укрытие для змеи и установите его в террариуме.[4]\n" +
            "Укрытие должно быть достаточно просторным, чтобы ваш питомец полностью помещался в нем, но вместе с тем относительно небольшим и уютным для змеи.[5]\n" +
            "Укрытия для змей имеют различный вид: это могут быть камни или полые бревна. Можно сделать укрытие и самостоятельно из подходящей пластиковой емкости, например из чистого кошачьего лотка для относительно крупной змеи или непрозрачного пищевого контейнера для более мелкой. Вырежьте в стенке емкости достаточно большое отверстие, чтобы змея могла пролезть через него, а затем поставьте контейнер дном вверх на дно террариума и вдавите его в подстилочный материал.[6]\n" +
            "\n" +
            "3\n" +
            "Выберите подходящий подстилочный материал. Этим материалом вы покроете дно террариума. Он будет впитывать мочу и фекалии. Во многих зоомагазинах можно приобрести подстилочный материал, специально предназначенный для змей.[7]\n" +
            "В качестве дешевого подстилочного материала можно использовать старые газеты. Просто порвите газетные листы на мелкие клочки и застелите ими дно террариума в несколько слоев.\n" +
            "Осиновая или сосновая стружка также хорошо подходит для подстилки, но необходимо убедиться, что она не обработана какими-либо веществами и не содержит летучих масел, которые токсичны для змей.\n" +
            "Можно также приобрести специальный «коврик» для рептилий и застелить им дно террариума.\n" +
            "Не используйте в качестве подстилки песок, наполнитель для кошачьих туалетов или землю.[8]\n" +
            "Узнайте, какой тип подстилки лучше всего подходит для вашего вида змей.[9]\n" +
            "\n" +
            "4\n" +
            "Достаньте несколько камней и веток. Змеям необходимо лазить по веткам и греться на камнях. Этим они занимаются в дикой природе, поэтому вам потребуются камни и ветки для того, чтобы ваш питомец оставался здоровым и довольным. Подходящие ветки и камни можно приобрести в большинстве зоомагазинов, либо просто собрать на улице.[10]\n" +
            "Наземным змеям требуется несколько камней, на которых они смогут греться, и одна ветка для лазанья, в то время как тем змеям, которые привыкли лазить по деревьям, например поперечнополосатой королевской змее или маисовому полозу, понадобится больше веток.\n" +
            "Если вы решили собрать камни и ветки на улице, проследите, чтобы они были чистыми. Сначала смойте с камней грязь теплой водой, а затем прокипятите их в воде в течение 30 минут. Чтобы очистить ветки, вымойте их в теплой воде и подержите 30 минут в духовке при 95–120 °C.[11]\n" +
            "\n" +
            "5\n" +
            "Установите нагревательную лампу. Змеи принадлежат к холоднокровным животным, поэтому им требуется хотя бы одна нагревательная лампа, чтобы они не мерзли. Нагревательные лампы для рептилий и другие приспособления можно приобрести в большинстве зоомагазинов. Они специально предназначены для того, чтобы прикрепить их к стенкам террариума или установить внутри него.[12]\n" +
            "Лампы накаливания дадут змее тепло и свет. Чем выше мощность лампы, тем больше тепла она будет излучать. Для маленьких террариумов часто хватает одной лампы, в то время как для более крупного может понадобиться несколько ламп.\n" +
            "Можно также приобрести специальные коврики с подогревом, которые кладутся под террариум и нагревают его дно.\n" +
            "Следите, чтобы змея ни в коем случае не могла прикоснуться к коврику с подогревом или другому нагревательному устройству, так как прямой контакт может привести к серьезным ожогам.\n" +
            "\n" +
            "6\n" +
            "Приобретите термометр и гидрометр, чтобы следить за температурой и влажностью. Различным видам змей требуется разная температура и влажность, поэтому выясните, какие условия лучше всего подходят для вашего питомца. Домашнего термостата недостаточно для того, чтобы определить, хватает ли тепла вашему питомцу. Необходимо разместить в террариуме термометр и гидрометр — это позволит вам поддерживать в нем оптимальные условия.[13]\n" +
            "Если температура слишком низка, возможно, следует установить еще одну нагревательную лампу или использовать более мощную лампочку.\n" +
            "Если в террариуме неподходящая влажность, можно положить в него мокрое полотенце или поставить дополнительное блюдце с водой, чтобы повысить влажность, либо убрать часть воды, чтобы понизить ее.\n" +
            "Желательно разместить по термометру на двух краях террариума и следить, чтобы на одной стороне было теплее, чем на другой. В этом случае змея сможет выбирать наиболее подходящее ей место.",
            "\n" +
            "\n" + "Обращение со змеей\n" +
                    "\n" +
                    "1\n" +
                    "Начинайте брать змею на руки лишь после того, как она успеет поесть на новом месте не менее четырех раз. Змея должна поесть четыре раза, прежде чем вы первый раз попытаетесь взять ее на руки. В этом случае она успеет освоиться в своем новом доме и будет чувствовать себя комфортно.\n" +
                    "\n" +
                    "2\n" +
                    "Не берите змею на руки, когда она еще переваривает пищу. Змеи заглатывают добычу целиком, и если ваш питомец еще не переварил съеденное, вы заметите утолщение в его теле. Если вы возьмете змею на руки, когда она переваривает пищу, то можете причинить ей дискомфорт, поэтому подождите, пока бугор в теле исчезнет.\n" +
                    "\n" +
                    "3\n" +
                    "Поддерживайте змею руками под средней 1/3 частью ее тела. Никогда не берите змею за голову или хвост. Лучше всего поддерживать змею под животом в средней 1/3 части ее тела. Так будет комфортнее для самой змеи, и вы легче сможете удержать ее.\n" +
                    "\n" +
                    "4\n" +
                    "Подумайте о том, чтобы приобрести крючок для змей. С его помощью вам легче будет извлечь змею из ее жилища, особенно если у вас большой террариум. Кроме того, иногда змея может принять вашу руку за еду, и крючок помогает избежать этого. Постоянно используйте крючок, когда достаете змею из террариума, и она привыкнет к нему и будет понимать, что означает его появление.\n" +
                    "Чтобы использовать крючок, просуньте его под тело змеи так, чтобы он оказался в начале средней части, а затем осторожно поднимите змею и достаньте ее из террариума. Поместите руку под живот змеи, когда она скользит по крючку, и опустите крючок после того, как будете надежно удерживать змею."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_care_snake);
        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);
        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), SnakeActivity.class);
                startActivity(intent);
            }
        });
    }
}