package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class CareHamste extends AppCompatActivity {
    private String[] arrayList = {"Как ухаживать за хомяком в домашних условиях\n" +
            "Хомяки могут стать превосходными домашними животными, если обеспечить им соответствующий уход. Средняя продолжительность жизни хомяков относительно короткая, около 1-2 лет, но они могут жить и до 5 лет. Грызуны ведут ночной образ жизни, любят копать и запасать еду.\n",
            "\n"+
            "Клетка для хомяка\n" +
                    "Для начала обустройте домик подходящими предметами для комфортной и здоровой жизни хомячка.\n" +
                    "\n" +
                    "Наполнитель\n" +
                    "Насыпьте на дно клетки опилки или древесный гранулят, сено. Не используйте кедровую или сосновую стружку, так как они содержат ароматические масла, сильно раздражающие кожу и слизистые оболочки хомячка. Небезопасно класть газету, картон или бумагу.\n" +
                    "Подстилку следует менять 1-2 раза в неделю и заполнять высотой около 3 см. К новому наполнителю подмешайте немного использованного, так хоме будет комфортнее.\n" +
                    "\n" +
                    "Игрушки\n" +
                    "Хомяки любят игрушки и используют их для удовлетворения разных потребностей: грызть, лазать, исследовать, рыть и прятаться. Отлично подойдут туннели, лабиринты, колеса.\n" +
                    "Большинство ветеринаров рекомендуют игрушки или жевательные палочки, специально предназначенные для грызунов, для обогащения, а также для сохранения здоровья зубов.\n" +
                    "\n" +
                    "Температура\n" +
                    "Комфортная температура для хомяка 18-21С, с относительной влажностью 40-70%. Ниже 10 градусов грызун становится сонным и впадает в спячку.",
                    "\n"+
                    "Уход за хомяком\n" +
                            "Ежедневно очищайте поилку и кормушку, заменяйте на чистую воду и свежий корм. Клетки следует чистить еженедельно или по мере необходимости. Содержание хомяка в антисанитарных условиях неприятно для питомца и может привести к инфекциям кожи, глаз и дыхательных путей. Убедитесь, что туалет находится вдали от места для сна и приема пищи.\n" +
                            "\n" +
                            "\n" +
                            "Регулярно расчесывайте шерсть хомяка, особенно длинношерстных пород. Для этой процедуры подойдет гребешок для мелких животных или мягкая зубная щетка.\n" +
                            "\n" +
                            "Грызунам также требуется периодическая стрижка когтей. Если когти хомяка скручиваются или выглядят ненормально, обратитесь к ветеринару.\n" +
                            "\n" +
                            "Следите за хомяками на наличие каких-либо новообразований, изменений в мочеиспускании и дефекации, проверяйте зубы на стоматологические заболевания.\n" +
                            "\n" +
                            "Хомяки чистоплотные животные и не требуют дополнительного купания с мылом и водой, если это не предписано ветеринаром. Тем не менее, некоторые карликовые породы хомяков любят регулярные песочные ванны. Важно удалить песок из клетки после купания, чтобы он не был постоянным раздражителем дыхательных путей.\n" +
                            "\n" +
                            "Давайте хомякам ежедневную физическую нагрузку. Для этого отлично подойдут специальные игрушки, колеса, прогулочные шары. Если решили выпустить хомяка из клетки, огородите территорию, где он будет бегать, для безопасности питомца."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_care_hamste);
        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);
        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), HamsterActivity.class);
                startActivity(intent);
            }
        });
    }
}