package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class CareLizard extends AppCompatActivity {

    private String[] arrayList = {"Подходящее жилище\n" +
            "\n" +
            "1\n" +
            "Узнайте, какой тип клетки необходим вашей ящерице. Это зависит от вида ящерицы. Учтите, что ящериц необходимо содержать при определенных температурах. Если зимой температура у вас дома падает ниже определенного значения, вам понадобится террариум с обогревом; так вы сохраните ящерицу в тепле и сэкономите на отоплении. При этом необходимо контролировать температуру в клетке, а для некоторых видов ящериц — еще и влажность воздуха. Следует также обеспечить подходящее освещение и пространство, достаточное для животного.\n" +
            "Убедитесь в том, что клетка надежно запирается, чтобы ящерица не могла выбраться из нее.\n" +
            "Часто ящериц держат в аквариуме, прикрытом сверху. Такой тип жилища хорошо подходит маленьким гекконам. Для леопардового геккона понадобится 75-литровый аквариум (террариум).\n" +
            "Ящериц можно также держать в пластмассовых контейнерах. Такой вид жилища подходит бородатым агамам, хотя лучше использовать виварий, сделанный из теплоизолирующего материала, например дерева, со стеклянной передней стенкой. Аквариумы могут слишком разогреваться или плохо удерживать тепло. Для бородатой агамы понадобится аквариум объемом 200 литров. Если вы выбрали пластмассовый контейнер, он должен быть по меньшей мере 0,6 х 1,2 метра в основании и 0,6 метра в высоту.\n" +
            "Третьим вариантом является клетка из проволоки. Такое жилище хорошо подходит хамелеонам, так как они смогут карабкаться по его стенкам. В этом случае клетка должна быть выше, чем для других видов ящериц.\n" +
            "\n" +
            "2\n" +
            "Выясните, какая температура необходима вашей ящерице. Многим рептилиям для поддержания нужной температуры требуется инфракрасная лампа. Учтите, что различные лампы выделяют разное количество тепла, поэтому следует выбрать ту лампу, которая обеспечит необходимый температурный режим.\n" +
            "Узнайте в зоомагазине, сколько тепла необходимо вашей ящерице. Большинству ящериц требуется разогретый участок с температурой 32–38 градусов Цельсия.\n" +
            "Вашей ящерице понадобится также прохладная зона, поэтому разместите лампу в углу клетки. Как правило, в прохладной зоне температура должна составлять 21–24 градуса Цельсия.\n" +
            "Проверьте температуру. При этом учитывайте, насколько высоко способна забраться ящерица. Пользуясь термометром, убедитесь в том, что в различных участках клетки температура не превышает рекомендуемых значений.\n" +
            "Выключайте греющие лампы на ночь. Если клетку необходимо обогревать и ночью, используйте для этого керамический обогреватель.\n" +
            "\n" +
            "3\n" +
            "Предусмотрите освещение. Большинству ящериц для нормальной жизни необходим свет. Вам потребуются лампы, дающие ультрафиолетовый свет в длинноволновом и средневолновом диапазоне (UVA и UVB). Включайте их днем примерно на 12 часов.\n" +
            "Приготовьте светильник заливающего света. Ящерице потребуется участок, где она сможет нежиться и греться на свету. Если у вас есть лампа дневного света, просто добавьте к ней ультрафиолетовую лампу, чтобы увеличить спектр освещения. Получившийся светильник заливающего света обеспечит ящерицу необходимым ей ультрафиолетовым излучением.\n" +
            "Закрепите светильник внутри клетки так, чтобы ящерица не могла до него добраться. Проследите, чтобы ящерица не могла достать до лампы и обжечься, но при этом могла подобраться к ней достаточно близко и греться в ее лучах. Приобретая лампу, внимательно изучите инструкцию к ней.\n" +
            "Создайте различные зоны. Ящерице необходим освещенный участок для того, чтобы греться, но ей требуется и зона в стороне от источников света. Большая часть клетки должна находиться в тени.\n" +
            "Выключайте лампы на ночь. Как и вам, ящерице не нужен свет ночью. Если вы не всегда помните об этом, приобретите светильник с таймером.\n" +
            "\n" +
            "4\n" +
            "Создайте укрытие, куда ящерица сможет прятаться. Большинству ящериц необходимо укромное место, куда они могли бы скрыться. Необходимо создать такое место в клетке. Для этой цели подойдут камни и мелкие ветки.\n" +
            "Создайте по крайней мере одно укромное место в прохладной зоне клетки.\n" +
            "Если вы используете подобранные на улице камни, прежде чем помещать их в клетку, помойте и простерилизуйте их в кипятке. Ветки также можно помыть и стерилизовать, поместив в разогретую до 120 градусов Цельсия духовку на 30 минут.\n" +
            "Некоторые виды ящериц, такие как хамелеоны, карабкаются по веткам.\n" +
            "\n" +
            "5\n" +
            "Не делайте подстилку. Хотя у вас может возникнуть желание выложить гравием пол клетки, не делайте этого, поскольку ящерица может проглотить камешки. Тем не менее, все зависит от конкретного вида вашей ящерицы.\n" +
            "В клетку можно постелить плотную пергаментную бумагу. Такая бумага не содержит чернил, которые могут быть вредными для вашей ящерицы. Подойдет и чистая газетная бумага, на которой ничего не печатали.\n" +
            "Некоторые виды ящериц любят зарываться, и в этом случае подойдет чистый песок, предназначенный для детских песочниц, или осиновые опилки."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_care_lizard);
        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);
        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), LizardActivity.class);
                startActivity(intent);
            }
        });
    }
}