package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class CareCat extends AppCompatActivity {

    private String[] arrayList = {"Правила ухода за кошками\n" +
            "Выбрать комфортную переноску. Перевозить питомца на руках или в обычной дорожной сумке небезопасно. Животное может вырваться наружу или испытать дополнительный стресс из-за нехватки воздуха. Поэтому для транспортировки малыша из питомника нужна просторная переноска.\n" +
            "\n" +
            "Чтобы не ошибиться с выбором, обращайте внимание на размер контейнера, наличие ребер жесткости на боковых стенках, вентиляционные отверстия и смотровые окошки. Питомец должен свободно вставать в переноске в полный рост, поворачиваться вокруг своей оси, ложиться с вытянутыми лапами и наблюдать за происходящим снаружи.\n" +
            "Специалисты рекомендуют выбрать модель на вырост. Это позволит использовать ее в будущем. Например, для посещения ветеринарной клиники или путешествий.\n" +
            "\n" +
            "Обезопасить внешнюю среду. Подготовить дом к появлению котенка нужно заранее. Спрячьте провода под напряжением, мусорные ведра, бытовую химию и домашнюю аптечку. Иначе малыш может получить серьезную электротравму или отравиться в момент исследования новой территории или в период смены зубов.\n" +
            "Оборудовать окна системой «анти-кошка». Установить на окнах стандартные анти-москитные сетки недостаточно. Они не выдержат вес питомца, если он попытается прыгнуть из окна в погоне за насекомым или птицей, и приведут к побегу или физической травме при падении с высоты.\n" +
            "Защита на окнах должна соответствовать габаритам животного и устанавливаться еще на этапе появления нового питомца в доме.\n" +
            "Подготовить изолированную комнату. Пускать котенка во все комнаты в первые дни переезда необязательно. Питомца нужно поместить в отдельную изолированную комнату и оставить в ней вещи с привычными запахами.\n" +
            "Специалисты рекомендуют взять в питомнике игрушки, подстилку и горсть туалетного наполнителя. Это уменьшит стресс при адаптации к новой обстановке и поможет сориентироваться в зонах сна, кормления и туалета.\n" +
            "\n" +
            "Дать время на адаптацию. Знакомить питомца с новым домом нужно постепенно. Поставьте переноску на пол, откройте дверцу, отойдите назад и позвольте котенку выбраться наружу самостоятельно. Смелые животные выходят из укрытия почти сразу. Осторожные и боязливые – сидят в нем часами."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_care_cat);

        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);

        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), CatActivity.class);
                startActivity(intent);
            }
        });
    }
}