package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class EatCat extends AppCompatActivity {

    private String[] arrayList = {"Питание кошек\n" +
            "Чтобы наладить питание в новом доме, выбирайте продукты, которые знакомы кошке по ее жизни в питомнике или приюте.\n" +
            "\n" +
            "Прежний корм должен составлять основу рациона не менее двух недель. Иначе кошка столкнется с несварением и потерей аппетита. Но в дальнейшем его можно постепенно заменить на новый. Главное – вводить незнакомые продукты понемногу. Например, поделить разовую порцию на 7 долей, 6 из которых будет приходиться на привычный корм, а 1 – на новый, и увеличивать соотношение нового корма к старому в течение 1 недели, пока старый корм не исчезнет из миски полностью.\n" +
            "Основные правила:\n" +
            "\n" +
            "Рассчитать КБЖУ. Рацион взрослой кошки должен состоять на 70% из животного белка и на 30% из жиров и углеводов.\n" +
            "Если кошка питается натуральными продуктами, расчет КБЖУ делается по специальным таблицам. Если готовыми кормами – по инструкции на обороте упаковки.\n" +
            "Оценить потребность в витаминно-минеральных добавках. Определить потребность в витаминах и минералах поможет ветеринарный врач.\n" +
            "Если кошка питается натуральными продуктами, врач посоветуют проходить не менее 1-2 курсов в год. Если готовыми кормами – дополнительный прикорм не потребуется.  Промышленный корм сбалансирован по составу производителем. Поэтому все, что нужно сделать владельцу, – правильно рассчитать разовую порцию с учетом веса питомца и проследить, чтобы корм подходил ему по возрасту.\n" +
            "\n" +
            "Установить режим кормления. Домашняя кошка должна питаться несколько раз в день малыми порциями и принимать пищу в одно и то же время. Поэтому давать корм лучше по расписанию, а в перерывах между кормлениями убирать миску в недоступное место.\n" +
            "Выбрать правильную посуду. Кормить кошку лучше из металлических мисок. Они не бьются и не накапливают неприятные запахи.\n" +
            "Также можно рассмотреть керамику. Но за ней придется больше ухаживать и следить, чтобы на краях не образовывались сколы и трещины. В них забиваются остатки пищи и начинают размножаться бактерии."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_eat_cat);

        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);

        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), CatActivity.class);
                startActivity(intent);
            }
        });
    }
}