package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class EatDog extends AppCompatActivity {

    private String[] arrayList = {"Питание\n" +
            "Животное должно полноценно питаться. Правильное питание включает в себя кормление качественными продуктами, которые удовлетворяют потребности организма в полезных веществах.\n" +
            "\n" +
            "Обычно собаку кормят два раза в день. Если вы завели щенка, то кормить его нужно чаще, четко соблюдая рацион.\n" +
            "\n" +
            "В свободном доступе должна быть чистая фильтрованная вода. Собакам рекомендуется два типа питания. Предлагаю разобрать каждый.\n" +
            "\n" +
            "Натуральный (домашний) корм\n" +
            "Кому не хочется полакомиться домашней натуральной пищей! Наши питомцы не стали исключением и с особым аппетитом поглощают свежую домашнюю еду.\n" +
            "\n" +
            "Вы можете самостоятельно готовить пищу для собаки. Для этого вам нужно рассчитать размер порции и необходимые составляющие, исходя из породы, возраста и веса животного. Не забудьте сделать поправки на особое состояние питомца, к примеру, болезнь, беременность, период лактации.\n" +
            "\n" +
            "Если вы не знаете, как правильно это сделать, обратитесь к зоо-диетологу, который распишет нормы кормления для вашего любимца. Кстати, он поможет решить еще одну часто возникающую проблему.\n" +
            "\n" +
            "Многие хозяева не могут самостоятельно обеспечить полноценный рацион, который включает не только энергетическую ценность продуктов, но и содержание витаминов. Если вы решили кормить пса только домашней пищей, ему нужно давать отдельно пищевые добавки. Основной рацион должен состоять из мяса, субпродуктов, творога, некоторых круп и овощей.\n" +
            "\n" +
            "Собаки не должны есть еду, приготовленную для всей семьи. Избыток соли, приправ, термической обработки может негативно повлиять на ЖКТ питомца.\n" +
            "\n" +
            "Сухой корм\n" +
            "Сухой корм используется намного чаще, нежели домашнее питание. Это удобно, так как уже все продумано за вас: состав, порция, количество витаминов.\n" +
            "\n" +
            "Есть несколько классов сухого корма – от эконом до премиум-холистик. Дешевый корм, продающийся на вес и без указания сроков годности, а также состава, несет прямой вред вашему питомцу.\n" +
            "\n" +
            "Лучшее решение – спросить у заводчика, который продает вам щенка, кормам каких фирм он отдает предпочтение. Скорее всего, этот же корм придется по вкусу и вашему любимцу.\n" +
            "\n" +
            "Нежелательно смешивать домашнее питание и сухой корм, так как организм привыкает к определенной пище и правильно ее перерабатывает, а смешение двух разных кормов несет губительные последствия для ЖКТ."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_eat_dog);

        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);

        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), DogActivity.class);
                startActivity(intent);
            }
        });
    }
}