package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class EatLizard extends AppCompatActivity {

    private String[] arrayList = {"Вода и питание\n" +
            "\n" +
            "1\n" +
            "Регулярно меняйте воду. Различным видам ящериц требуются разные емкости для воды. Например, некоторым подходят мелкие блюдца, в то время как для других лучше использовать капельницы. К примеру, хамелеону необходима капельница, поскольку он не будет пить из блюдца.\n" +
            "О том, какой поильник лучше подходит вашей ящерице, вы можете узнать в зоомагазине или у ветеринара.\n" +
            "Не забывайте ежедневно менять воду, особенно если вы используете маленькое блюдце.\n" +
            "Некоторые ящерицы любят купаться, и в этом случае вам понадобится достаточно большая емкость с водой.\n" +
            "\n" +
            "2\n" +
            "Опрыскивайте ящерицу водой. Некоторые виды необходимо опрыскивать раз в день. Пользуйтесь бутылкой с распылителем, используя режим распыления, а не струи. Тем самым вы создадите необходимую влажность.\n" +
            "К примеру, игуанам необходимо увлажнение, в то время как бородатые агамы обходятся без него.\n" +
            "\n" +
            "3\n" +
            "Давайте ящерице подходящий корм. Большинство ящериц питаются насекомыми, причем предпочитают живых насекомых. В зоомагазине можно приобрести сверчков, а также личинок восковой моли, мучных червей и тараканов, предназначенных для кормления ящериц. Многие хозяева ящериц специально содержат колонию сверчков или тараканов для того, чтобы кормить ими своих питомцев. Некоторые ящерицы питаются исключительно насекомыми, в то время как другие являются всеядными или предпочитают растительную пищу.\n" +
            "\n" +
            "Если вы содержите колонию сверчков, следите за тем, чтобы одну пятую их питания составлял карбонат кальция; давайте его насекомым минимум за два дня перед тем, как скармливать их ящерице. Остальные четыре пятых может составлять обычный корм для сверчков.\n" +
            "\n" +
            "Плотоядные ящерицы питаются насекомыми, но при этом они могут есть также более мелких ящериц и лягушек. Некоторым плотоядным ящерицам можно давать также мелких грызунов, рыбу, креветок и цыплят. Пример плотоядной ящерицы — леопардовый геккон, которого следует кормить сверчками и мучными червями.\n" +
            "Вы можете также собирать насекомых при помощи сачка. Однако при этом следует быть уверенным, что данная территория не обрабатывалась инсектицидами; кроме того, вы не сможете собрать достаточное количество насекомых в холодное время года.\n" +
            "\n" +
            "Некоторые виды ящериц являются всеядными. Кроме насекомых, они едят растения, например одуванчик и клевер, а также различные фрукты и овощи, такие как помидоры, груши, яблоки и латук. При этом они не отказываются от мелких насекомых (например, улиток и мучных червей) и даже от корма для собак (к сухому корму следует добавлять немного воды). Бородатые агамы всеядны, и на три четверти их рацион может состоять из зелени (листьев капусты и латука), а на одну четверть — из пасты, приготовленной из мучных червей, цикад или других насекомых.\n" +
            "\n" +
            "Большинство всеядных и плотоядных ящериц достаточно кормить 2–3 раза в неделю. Однако мелких или молодых ящериц следует кормить чаще. Объем кормежки зависит от размеров вашей ящерицы.\n" +
            "Некоторые виды ящериц питаются исключительно растениями, то есть им необходимы лишь овощи. К таким видам принадлежит игуана. Игуаны едят зеленые листья, а также различные фрукты и овощи, и им необходима ежедневная кормежка.\n" +
            "Кусочки пищи должны быть достаточно мелкими, чтобы ящерица не подавилась. Кроме того, следует помещать еду на маленькое блюдце, особенно в том случае, если на полу клетки песок."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_eat_lizard);
        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);
        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), LizardActivity.class);
                startActivity(intent);
            }
        });
    }
}