package com.example.progect;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

public class EatSnake extends AppCompatActivity {
    private String[] arrayList = {"Кормление змеи\n" +
            "\n" +
            "1\n" +
            "Заполните морозильную камеру «добычей». Хотя в дикой природе змеям приходится охотиться на свою добычу, в домашних условиях многие из них предпочитают есть уже мертвых мышей и крыс. Замороженных мышей и крыс можно приобрести в зоомагазине. Купите дюжину и положите в морозильную камеру, чтобы по мере необходимости давать своему питомцу.\n" +
            "Лучше не держать корм для змеи в той же морозильной камере, в которой вы храните продукты питания. Приобретите небольшую морозильную камеру, чтобы хранить в ней лишь корм для своего питомца.\n" +
            "Узнайте, какая пища лучше всего подходит для вашего вида змей.\n" +
            "\n" +
            "2\n" +
            "Молодых и мелких змей следует кормить чаще, чем их более крупных сородичей. Молодым и мелким змеям необходимо есть два раза в неделю, в то время как более крупных и взрослых змей достаточно кормить раз в 1–3 недели. Чаще требуется есть и самкам с приближением сезона размножения. Если вы не знаете, как часто следует кормить вашего питомца, обязательно проконсультируйтесь насчет этого с ветеринаром-герпетологом.\n" +
            "О том, как часто следует кормить змею, можно судить по ее поведению. Например, если ваш питомец не обращает внимания на предложенную ему пищу, он, скорее всего, еще не проголодался. Однако, если змея жадно заглатывает пищу сразу же после того, как вы положите ее в террариум, вероятно, ее следует кормить чаще.\n" +
            "\n" +
            "3\n" +
            "Если ваш питомец не хочет есть мертвую «добычу», пошевелите ею. Иногда живущих в неволе змей не интересуют тушки мышей, и они отказываются есть их. Если ваш питомец игнорирует пищу, попробуйте пошевелить ею перед его мордой. Этого может быть достаточно, чтобы привлечь внимание змеи и соблазнить ее съесть корм.\n" +
            "\n" +
            "4\n" +
            "Накрывайте террариум, когда змея ест. Если змея поначалу отвергает пищу, попробуйте прикрывать террариум тканью. Набросьте на террариум темную ткань и на 30–60 минут оставьте змею в покое.\n" +
            "\n" +
            "5\n" +
            "Давайте змее живой корм лишь в том случае, если она отказывается есть мертвую добычу. Если змея по-прежнему отвергает мертвую добычу, вероятно, придется приобрести ей живой корм. В зоомагазине можно купить живых мышей или крыс, которых специально разводят в качестве корма для змей. Если вы будете давать своему питомцу живую добычу, необходимо следить, чтобы змея поймала и съела свою жертву. В противном случае грызун в панике может атаковать змею и серьезно поранить ее.\n" +
            "\n" +
            "6\n" +
            "Следите, чтобы миска с водой была чистой и полной. Змея должна иметь постоянный доступ к свежей чистой воде в керамической посуде. Ежедневно меняйте воду и достаточно часто проверяйте, чтобы в миске не было осадка, фекалий и другой грязи."};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_eat_snake);
        ListView List = findViewById(R.id.List);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(this, android.R.layout.simple_list_item_1, arrayList);
        List.setAdapter(adapter);
        Button back = findViewById(R.id.back);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(getApplicationContext(), SnakeActivity.class);
                startActivity(intent);
            }
        });
    }
}